// 배열 연습하기---------------------------------------
public class Class0511_08 {

	public static void main(String[] args) {
//		//int 배열
//		int[] num = new int[5];
//		num[0] = 1;
//		num[1] = 2;
//		num[2] = 3;
//		num[3] = 4;
//		num[4] = 5;
//		
//		for(int i=0;i<5;i++) {
//			System.out.println(num[i]);          //1,2,3,4,5 : 값이 나온당!
//		}
////----------------------------------------------------------------------------		
//		for(int i=0;i<6;i++) {
//			System.out.println(num[i]);          //1,2,3,4,5까지 나오고 num[6]의 값이 없어서 IndexOutofBounds오류 뜬다
//		}
////----------------------------------------------------------------------------			
//		for(int i=0;i<num.length;i++) {          //num.length이렇게 쓰면 오류가 조금 줄어든다
//			System.out.println(num[i]);          
//		}
////----------------------------------------------------------------------------	
//	//배열 100개를 만들고 1-100까지 숫자를 입력하기
//		int[] num = new int[100];
//		
//		for (int i = 0; i < 100; i++) {
//			num[i] = i + 1;
//			System.out.println(num[i]);
//		}
////----------------------------------------------------------------------------		
	//10개의 배열을 만들고 랜덤숫자 1-10까지 숫자를 입력해서 출력하세용
		int[] num = new int[10];
		
		for (int i = 0; i < 10;i++) {
//			int random = (int)(Math.random()*10)+1;         //변수지정 안하고 그냥 바로 넣어도 된다
			num[i] = (int)(Math.random()*10)+1;
			System.out.println("num[" + i + "] = " + num[i]);
		}

	}

}
